; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-7-4-40)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	package29 - package
	package30 - package
	package31 - package
	package32 - package
	package33 - package
	package34 - package
	package35 - package
	package36 - package
	package37 - package
	package38 - package
	package39 - package
	package40 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p1-3 - location
	p1-4 - location
	p1-5 - location
	p2-0 - location
	p3-0 - location
	p4-1 - location
	p4-2 - location
	p5-1 - location
	p5-2 - location
	p5-4 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s0)
	(at driver3 s1)
	(at driver4 s4)
	(at driver5 s5)
	(at driver6 s3)
	(at driver7 s4)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at truck4 s3)
	(empty truck4)
	(at package1 s1)
	(at package2 s0)
	(at package3 s0)
	(at package4 s3)
	(at package5 s5)
	(at package6 s1)
	(at package7 s4)
	(at package8 s3)
	(at package9 s3)
	(at package10 s1)
	(at package11 s1)
	(at package12 s3)
	(at package13 s5)
	(at package14 s5)
	(at package15 s1)
	(at package16 s0)
	(at package17 s1)
	(at package18 s0)
	(at package19 s5)
	(at package20 s4)
	(at package21 s1)
	(at package22 s3)
	(at package23 s5)
	(at package24 s0)
	(at package25 s0)
	(at package26 s2)
	(at package27 s5)
	(at package28 s4)
	(at package29 s2)
	(at package30 s0)
	(at package31 s2)
	(at package32 s4)
	(at package33 s0)
	(at package34 s4)
	(at package35 s0)
	(at package36 s0)
	(at package37 s1)
	(at package38 s1)
	(at package39 s4)
	(at package40 s0)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(link s0 s1)
	(link s1 s0)
	(link s0 s2)
	(link s2 s0)
	(link s1 s2)
	(link s2 s1)
	(link s1 s3)
	(link s3 s1)
	(link s2 s4)
	(link s4 s2)
	(link s3 s0)
	(link s0 s3)
	(link s3 s2)
	(link s2 s3)
	(link s3 s5)
	(link s5 s3)
	(link s4 s3)
	(link s3 s4)
	(link s5 s4)
	(link s4 s5)
)
	(:goal (and
	(at driver1 s1)
	(at driver2 s1)
	(at driver4 s4)
	(at driver5 s1)
	(at driver6 s4)
	(at driver7 s0)
	(at truck1 s4)
	(at truck2 s0)
	(at truck3 s0)
	(at truck4 s4)
	(at package1 s4)
	(at package2 s5)
	(at package4 s4)
	(at package5 s2)
	(at package7 s2)
	(at package8 s4)
	(at package9 s0)
	(at package10 s3)
	(at package11 s5)
	(at package12 s0)
	(at package13 s1)
	(at package14 s4)
	(at package15 s4)
	(at package16 s0)
	(at package17 s5)
	(at package18 s2)
	(at package19 s5)
	(at package20 s1)
	(at package21 s3)
	(at package22 s0)
	(at package23 s5)
	(at package24 s5)
	(at package25 s0)
	(at package26 s1)
	(at package27 s2)
	(at package28 s2)
	(at package29 s1)
	(at package30 s5)
	(at package31 s1)
	(at package32 s5)
	(at package33 s5)
	(at package34 s5)
	(at package35 s0)
	(at package36 s2)
	(at package37 s1)
	(at package38 s0)
	(at package39 s3)
	(at package40 s3)
	))


)

; plan
1. (board-truck driver3 s1 truck2)
   deleted: (at driver3 s1) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 7 of 48
2. (drive-truck driver3 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 7 of 48
3. (board-truck driver6 s3 truck4)
   deleted: (at driver6 s3) (empty truck4)
   added: (driving driver6 truck4)
   goals met: 7 of 48
4. (drive-truck driver3 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 8 of 48
5. (load-truck s0 package40 truck2)
   deleted: (at package40 s0)
   added: (in package40 truck2)
   goals met: 8 of 48
6. (drive-truck driver3 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 7 of 48
7. (load-truck s1 package38 truck2)
   deleted: (at package38 s1)
   added: (in package38 truck2)
   goals met: 7 of 48
8. (drive-truck driver3 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 8 of 48
9. (unload-truck s0 package38 truck2)
   deleted: (in package38 truck2)
   added: (at package38 s0)
   goals met: 9 of 48
10. (load-truck s0 package36 truck2)
   deleted: (at package36 s0)
   added: (in package36 truck2)
   goals met: 9 of 48
11. (drive-truck driver3 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 8 of 48
12. (load-truck s1 package21 truck2)
   deleted: (at package21 s1)
   added: (in package21 truck2)
   goals met: 8 of 48
13. (load-truck s1 package17 truck2)
   deleted: (at package17 s1)
   added: (in package17 truck2)
   goals met: 8 of 48
14. (drive-truck driver3 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 9 of 48
15. (load-truck s0 package33 truck2)
   deleted: (at package33 s0)
   added: (in package33 truck2)
   goals met: 9 of 48
16. (load-truck s0 package30 truck2)
   deleted: (at package30 s0)
   added: (in package30 truck2)
   goals met: 9 of 48
17. (drive-truck driver3 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 8 of 48
18. (load-truck s1 package15 truck2)
   deleted: (at package15 s1)
   added: (in package15 truck2)
   goals met: 8 of 48
19. (drive-truck driver3 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 8 of 48
20. (drive-truck driver3 s2 s4 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   goals met: 8 of 48
21. (load-truck s4 package7 truck2)
   deleted: (at package7 s4)
   added: (in package7 truck2)
   goals met: 8 of 48
22. (load-truck s4 package39 truck2)
   deleted: (at package39 s4)
   added: (in package39 truck2)
   goals met: 8 of 48
23. (load-truck s4 package34 truck2)
   deleted: (at package34 s4)
   added: (in package34 truck2)
   goals met: 8 of 48
24. (drive-truck driver3 s4 s5 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s5)
   goals met: 8 of 48
25. (load-truck s5 package5 truck2)
   deleted: (at package5 s5)
   added: (in package5 truck2)
   goals met: 8 of 48
26. (unload-truck s5 package34 truck2)
   deleted: (in package34 truck2)
   added: (at package34 s5)
   goals met: 9 of 48
27. (drive-truck driver3 s5 s3 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s3)
   goals met: 9 of 48
28. (drive-truck driver3 s3 s2 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   goals met: 9 of 48
29. (unload-truck s2 package7 truck2)
   deleted: (in package7 truck2)
   added: (at package7 s2)
   goals met: 10 of 48
30. (unload-truck s2 package5 truck2)
   deleted: (in package5 truck2)
   added: (at package5 s2)
   goals met: 11 of 48
31. (drive-truck driver3 s2 s3 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   goals met: 11 of 48
32. (drive-truck driver3 s3 s5 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   goals met: 11 of 48
33. (unload-truck s5 package33 truck2)
   deleted: (in package33 truck2)
   added: (at package33 s5)
   goals met: 12 of 48
34. (unload-truck s5 package30 truck2)
   deleted: (in package30 truck2)
   added: (at package30 s5)
   goals met: 13 of 48
35. (drive-truck driver3 s5 s3 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s3)
   goals met: 13 of 48
36. (drive-truck driver3 s3 s2 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   goals met: 13 of 48
37. (unload-truck s2 package36 truck2)
   deleted: (in package36 truck2)
   added: (at package36 s2)
   goals met: 14 of 48
38. (load-truck s2 package31 truck2)
   deleted: (at package31 s2)
   added: (in package31 truck2)
   goals met: 14 of 48
39. (drive-truck driver3 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 14 of 48
40. (unload-truck s1 package31 truck2)
   deleted: (in package31 truck2)
   added: (at package31 s1)
   goals met: 15 of 48
41. (drive-truck driver3 s1 s3 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   goals met: 15 of 48
42. (unload-truck s3 package40 truck2)
   deleted: (in package40 truck2)
   added: (at package40 s3)
   goals met: 16 of 48
43. (drive-truck driver3 s3 s4 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   goals met: 16 of 48
44. (load-truck s4 package32 truck2)
   deleted: (at package32 s4)
   added: (in package32 truck2)
   goals met: 16 of 48
45. (drive-truck driver3 s4 s5 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s5)
   goals met: 16 of 48
46. (unload-truck s5 package32 truck2)
   deleted: (in package32 truck2)
   added: (at package32 s5)
   goals met: 17 of 48
47. (load-truck s5 package27 truck2)
   deleted: (at package27 s5)
   added: (in package27 truck2)
   goals met: 17 of 48
48. (drive-truck driver3 s5 s3 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s3)
   goals met: 17 of 48
49. (drive-truck driver3 s3 s2 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   goals met: 17 of 48
50. (load-truck s2 package29 truck2)
   deleted: (at package29 s2)
   added: (in package29 truck2)
   goals met: 17 of 48
51. (drive-truck driver3 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 17 of 48
52. (unload-truck s1 package29 truck2)
   deleted: (in package29 truck2)
   added: (at package29 s1)
   goals met: 18 of 48
53. (load-truck s1 package11 truck2)
   deleted: (at package11 s1)
   added: (in package11 truck2)
   goals met: 18 of 48
54. (drive-truck driver3 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 19 of 48
55. (drive-truck driver3 s0 s3 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   goals met: 18 of 48
56. (unload-truck s3 package39 truck2)
   deleted: (in package39 truck2)
   added: (at package39 s3)
   goals met: 19 of 48
57. (drive-truck driver3 s3 s4 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   goals met: 19 of 48
58. (load-truck s4 package28 truck2)
   deleted: (at package28 s4)
   added: (in package28 truck2)
   goals met: 19 of 48
59. (drive-truck driver3 s4 s2 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   goals met: 19 of 48
60. (unload-truck s2 package28 truck2)
   deleted: (in package28 truck2)
   added: (at package28 s2)
   goals met: 20 of 48
61. (unload-truck s2 package27 truck2)
   deleted: (in package27 truck2)
   added: (at package27 s2)
   goals met: 21 of 48
62. (drive-truck driver3 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 22 of 48
63. (load-truck s0 package24 truck2)
   deleted: (at package24 s0)
   added: (in package24 truck2)
   goals met: 22 of 48
64. (drive-truck driver3 s0 s3 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   goals met: 21 of 48
65. (drive-truck driver3 s3 s5 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   goals met: 21 of 48
66. (unload-truck s5 package24 truck2)
   deleted: (in package24 truck2)
   added: (at package24 s5)
   goals met: 22 of 48
67. (unload-truck s5 package17 truck2)
   deleted: (in package17 truck2)
   added: (at package17 s5)
   goals met: 23 of 48
68. (load-truck s5 package14 truck2)
   deleted: (at package14 s5)
   added: (in package14 truck2)
   goals met: 23 of 48
69. (drive-truck driver3 s5 s4 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   goals met: 23 of 48
70. (load-truck s4 package20 truck2)
   deleted: (at package20 s4)
   added: (in package20 truck2)
   goals met: 23 of 48
71. (drive-truck driver3 s4 s2 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   goals met: 23 of 48
72. (load-truck s2 package26 truck2)
   deleted: (at package26 s2)
   added: (in package26 truck2)
   goals met: 23 of 48
73. (drive-truck driver3 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 23 of 48
74. (unload-truck s1 package26 truck2)
   deleted: (in package26 truck2)
   added: (at package26 s1)
   goals met: 24 of 48
75. (unload-truck s1 package20 truck2)
   deleted: (in package20 truck2)
   added: (at package20 s1)
   goals met: 25 of 48
76. (drive-truck driver3 s1 s3 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   goals met: 25 of 48
77. (unload-truck s3 package21 truck2)
   deleted: (in package21 truck2)
   added: (at package21 s3)
   goals met: 26 of 48
78. (drive-truck driver3 s3 s4 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   goals met: 26 of 48
79. (unload-truck s4 package15 truck2)
   deleted: (in package15 truck2)
   added: (at package15 s4)
   goals met: 27 of 48
80. (drive-truck driver3 s4 s5 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s5)
   goals met: 27 of 48
81. (load-truck s5 package13 truck2)
   deleted: (at package13 s5)
   added: (in package13 truck2)
   goals met: 27 of 48
82. (drive-truck driver3 s5 s3 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s3)
   goals met: 27 of 48
83. (drive-truck driver3 s3 s0 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   goals met: 28 of 48
84. (drive-truck driver3 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 27 of 48
85. (unload-truck s1 package13 truck2)
   deleted: (in package13 truck2)
   added: (at package13 s1)
   goals met: 28 of 48
86. (load-truck s1 package10 truck2)
   deleted: (at package10 s1)
   added: (in package10 truck2)
   goals met: 28 of 48
87. (drive-truck driver3 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 29 of 48
88. (load-truck s0 package2 truck2)
   deleted: (at package2 s0)
   added: (in package2 truck2)
   goals met: 29 of 48
89. (drive-truck driver3 s0 s3 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   goals met: 28 of 48
90. (unload-truck s3 package10 truck2)
   deleted: (in package10 truck2)
   added: (at package10 s3)
   goals met: 29 of 48
91. (drive-truck driver3 s3 s5 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   goals met: 29 of 48
92. (unload-truck s5 package2 truck2)
   deleted: (in package2 truck2)
   added: (at package2 s5)
   goals met: 30 of 48
93. (unload-truck s5 package11 truck2)
   deleted: (in package11 truck2)
   added: (at package11 s5)
   goals met: 31 of 48
94. (drive-truck driver3 s5 s3 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s3)
   goals met: 31 of 48
95. (drive-truck driver3 s3 s0 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   goals met: 32 of 48
96. (load-truck s0 package18 truck2)
   deleted: (at package18 s0)
   added: (in package18 truck2)
   goals met: 32 of 48
97. (drive-truck driver3 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 31 of 48
98. (drive-truck driver3 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 31 of 48
99. (unload-truck s2 package18 truck2)
   deleted: (in package18 truck2)
   added: (at package18 s2)
   goals met: 32 of 48
100. (load-truck s3 package9 truck4)
   deleted: (at package9 s3)
   added: (in package9 truck4)
   goals met: 32 of 48
101. (load-truck s3 package8 truck4)
   deleted: (at package8 s3)
   added: (in package8 truck4)
   goals met: 32 of 48
102. (load-truck s3 package4 truck4)
   deleted: (at package4 s3)
   added: (in package4 truck4)
   goals met: 32 of 48
103. (drive-truck driver6 s3 s4 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s4)
   goals met: 33 of 48
104. (drive-truck driver3 s2 s3 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   goals met: 33 of 48
105. (load-truck s3 package22 truck2)
   deleted: (at package22 s3)
   added: (in package22 truck2)
   goals met: 33 of 48
106. (load-truck s3 package12 truck2)
   deleted: (at package12 s3)
   added: (in package12 truck2)
   goals met: 33 of 48
107. (drive-truck driver3 s3 s0 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   goals met: 34 of 48
108. (unload-truck s0 package22 truck2)
   deleted: (in package22 truck2)
   added: (at package22 s0)
   goals met: 35 of 48
109. (unload-truck s0 package12 truck2)
   deleted: (in package12 truck2)
   added: (at package12 s0)
   goals met: 36 of 48
110. (drive-truck driver3 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 35 of 48
111. (load-truck s1 package1 truck2)
   deleted: (at package1 s1)
   added: (in package1 truck2)
   goals met: 35 of 48
112. (drive-truck driver3 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 35 of 48
113. (unload-truck s4 package8 truck4)
   deleted: (in package8 truck4)
   added: (at package8 s4)
   goals met: 36 of 48
114. (unload-truck s4 package4 truck4)
   deleted: (in package4 truck4)
   added: (at package4 s4)
   goals met: 37 of 48
115. (walk driver1 s4 p1-4)
   deleted: (at driver1 s4)
   added: (at driver1 p1-4)
   goals met: 37 of 48
116. (walk driver1 p1-4 s1)
   deleted: (at driver1 p1-4)
   added: (at driver1 s1)
   goals met: 38 of 48
117. (walk driver2 s0 p3-0)
   deleted: (at driver2 s0)
   added: (at driver2 p3-0)
   goals met: 38 of 48
118. (walk driver2 p3-0 s3)
   deleted: (at driver2 p3-0)
   added: (at driver2 s3)
   goals met: 38 of 48
119. (walk driver2 s3 p1-3)
   deleted: (at driver2 s3)
   added: (at driver2 p1-3)
   goals met: 38 of 48
120. (walk driver2 p1-3 s1)
   deleted: (at driver2 p1-3)
   added: (at driver2 s1)
   goals met: 39 of 48
121. (walk driver5 s5 p1-5)
   deleted: (at driver5 s5)
   added: (at driver5 p1-5)
   goals met: 39 of 48
122. (walk driver5 p1-5 s1)
   deleted: (at driver5 p1-5)
   added: (at driver5 s1)
   goals met: 40 of 48
123. (walk driver7 s4 p4-2)
   deleted: (at driver7 s4)
   added: (at driver7 p4-2)
   goals met: 40 of 48
124. (drive-truck driver3 s2 s4 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   goals met: 40 of 48
125. (unload-truck s4 package14 truck2)
   deleted: (in package14 truck2)
   added: (at package14 s4)
   goals met: 41 of 48
126. (unload-truck s4 package1 truck2)
   deleted: (in package1 truck2)
   added: (at package1 s4)
   goals met: 42 of 48
127. (drive-truck driver3 s4 s3 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   goals met: 42 of 48
128. (drive-truck driver3 s3 s0 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   goals met: 43 of 48
129. (walk driver7 p4-2 s2)
   deleted: (at driver7 p4-2)
   added: (at driver7 s2)
   goals met: 43 of 48
130. (board-truck driver2 s1 truck3)
   deleted: (at driver2 s1) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 42 of 48
131. (disembark-truck driver6 s4 truck4)
   deleted: (driving driver6 truck4)
   added: (at driver6 s4) (empty truck4)
   goals met: 43 of 48
132. (walk driver7 s2 p2-0)
   deleted: (at driver7 s2)
   added: (at driver7 p2-0)
   goals met: 43 of 48
133. (walk driver7 p2-0 s0)
   deleted: (at driver7 p2-0)
   added: (at driver7 s0)
   goals met: 44 of 48
134. (drive-truck driver2 s1 s2 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   goals met: 44 of 48
135. (disembark-truck driver2 s2 truck3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s2) (empty truck3)
   goals met: 44 of 48
136. (board-truck driver2 s2 truck1)
   deleted: (at driver2 s2) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 44 of 48
137. (board-truck driver6 s4 truck4)
   deleted: (at driver6 s4) (empty truck4)
   added: (driving driver6 truck4)
   goals met: 43 of 48
138. (drive-truck driver2 s2 s4 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   goals met: 44 of 48
139. (disembark-truck driver2 s4 truck1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s4) (empty truck1)
   goals met: 44 of 48
140. (walk driver2 s4 p1-4)
   deleted: (at driver2 s4)
   added: (at driver2 p1-4)
   goals met: 44 of 48
141. (walk driver2 p1-4 s1)
   deleted: (at driver2 p1-4)
   added: (at driver2 s1)
   goals met: 45 of 48
142. (walk driver7 s0 p2-0)
   deleted: (at driver7 s0)
   added: (at driver7 p2-0)
   goals met: 44 of 48
143. (walk driver7 p2-0 s2)
   deleted: (at driver7 p2-0)
   added: (at driver7 s2)
   goals met: 44 of 48
144. (board-truck driver7 s2 truck3)
   deleted: (at driver7 s2) (empty truck3)
   added: (driving driver7 truck3)
   goals met: 44 of 48
145. (drive-truck driver7 s2 s0 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   goals met: 45 of 48
146. (disembark-truck driver7 s0 truck3)
   deleted: (driving driver7 truck3)
   added: (at driver7 s0) (empty truck3)
   goals met: 46 of 48
147. (drive-truck driver6 s4 s3 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s3)
   goals met: 45 of 48
148. (drive-truck driver6 s3 s0 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s0)
   goals met: 45 of 48
149. (unload-truck s0 package9 truck4)
   deleted: (in package9 truck4)
   added: (at package9 s0)
   goals met: 46 of 48
150. (drive-truck driver6 s0 s3 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s3)
   goals met: 46 of 48
151. (drive-truck driver6 s3 s4 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s4)
   goals met: 47 of 48
152. (disembark-truck driver6 s4 truck4)
   deleted: (driving driver6 truck4)
   added: (at driver6 s4) (empty truck4)
   goals met: 48 of 48
